DataProcessors/ОтправкаДанныхПИФНаСайт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ОтправкаДанныхПИФНаСайт</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПаевыеИнвестиционныеФонды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выбран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ТипыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриЗаписиЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриПроведенииДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриОтменеПроведенияДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриЗаписиРегистраСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриЗаписиСправочников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийВызов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриЗагрузкеДанныхВАнкету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередЗаписьюРегистраСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриЗаписиДвиженийРегистровНакопления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриЗаписиДокумента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ОтправкаДанныхПИФНаСайт/Forms/Форма/Ext/Form/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЭтоПодтверждениеСЧА") Тогда
		
		ЭтаФорма.ЭтоПодтверждениеСЧА = Истина;
		
		ПараметрыОбработки = Параметры.ПараметрыОбработки;
		
		Объект.Организация 		= ПараметрыОбработки.Организация;
		Объект.ПутьКФайлу 		= ПараметрыОбработки.ПутьКФайлу;
		Объект.Брокер 			= ПараметрыОбработки.Брокер;
		Объект.НачалоПериода 	= ПараметрыОбработки.Дата;
		Объект.КонецПериода 	= ПараметрыОбработки.Дата;
		Объект.ДатаВыгрузки 	= ПараметрыОбработки.ДатаПодтверждения;
		
		Объект.ПаевыеИнвестиционныеФонды.Очистить();
		СтрокаПИФ = Объект.ПаевыеИнвестиционныеФонды.Добавить();
		СтрокаПИФ.Выбран = Истина;
		СтрокаПИФ.СчетДоверительногоУправления = ПараметрыОбработки.СчетДоверительногоУправления;
		СтрокаПИФ.АдресСайта = ПланыВидовХарактеристик.ДополнительныеСведения.ЗначениеДополнительнойНастройки(, "Обработка.ОтправкаДанныхПИФНаСайт", ПараметрыОбработки.СчетДоверительногоУправления);
		
	Иначе
		
		Объект.Организация		= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
		Объект.НачалоПериода	= Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, НачалоДня(ТекущаяДата()), -2);
		Объект.КонецПериода		= Объект.НачалоПериода;	
		Объект.ДатаВыгрузки		= ТекущаяДата();
		
		// Заполняем активными ПИФ
		ЗаполнитьПаевыеИнвестиционныеФондыСервер();
		
		// Защита от случайной отправки старых данных 
		ЭтаФорма.Модифицированность = Истина;
		
		// Ограничим доступность команд отправки
		ЭтаФорма.ЭтоПолноправныйПользователь = РаботаСПользователями.ЭтоПолноправныйПользователь();
		ЭтаФорма.ЭтоКонтролер = РольДоступна("КонтрольУправляющихКомпаний");
		
		Элементы.ФормаВыгрузитьИОтправить.Видимость = ЭтаФорма.ЭтоПолноправныйПользователь Или ЭтаФорма.ЭтоКонтролер;
		Элементы.ФормаВыгрузить.Видимость 			= ЭтаФорма.ЭтоПолноправныйПользователь;
		Элементы.ФормаОтправить.Видимость 			= ЭтаФорма.ЭтоПолноправныйПользователь;
		Элементы.ФормаОтправитьВMatrix.Видимость 	= ЭтаФорма.ЭтоПолноправныйПользователь;
		Элементы.ФормаОтправитьВЛКК.Видимость 		= ЭтаФорма.ЭтоПолноправныйПользователь;
		Элементы.ПараметрыПодключения.Видимость		= ЭтаФорма.ЭтоПолноправныйПользователь;
		Элементы.ПутьКФайлу.Видимость				= ЭтаФорма.ЭтоПолноправныйПользователь;
		Элементы.ВыгрузкаЗаПериод.ТолькоПросмотр	= Не (ЭтаФорма.ЭтоПолноправныйПользователь Или ЭтаФорма.ЭтоКонтролер);
		
		Элементы.ПаевыеИнвестиционныеФондыУстановитьОтметки.Видимость 	= ЭтаФорма.ЭтоПолноправныйПользователь Или ЭтаФорма.ЭтоКонтролер;
		Элементы.ПаевыеИнвестиционныеФондыСнятьОтметки.Видимость 		= ЭтаФорма.ЭтоПолноправныйПользователь Или ЭтаФорма.ЭтоКонтролер;
		Элементы.ПаевыеИнвестиционныеФондыВыбран.Видимость 				= ЭтаФорма.ЭтоПолноправныйПользователь Или ЭтаФорма.ЭтоКонтролер;
		
	КонецЕсли; 

	ПараметрыПодключения = ПрочитатьПараметрыПодключения(Объект.Организация);
	Если ТипЗнч(ПараметрыПодключения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ПараметрыПодключения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(Объект.Брокер) Тогда
		Объект.Брокер = ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_БК_Регион");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда
		Объект.ПутьКФайлу = КаталогВременныхФайлов() + "xml.xml";
	КонецЕсли;
	
	// Очищаем сохраненные выбранные ПИФ, чтобы принудительно инициализировать сохранение настроек
	ВыбранныеПИФ.Очистить();
	ПолучитьИнформациюССайта();
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	ВыбранныеСтроки = Объект.ПаевыеИнвестиционныеФонды.НайтиСтроки(Новый Структура("Выбран", Истина));
	Для Каждого ВыбраннаяСтрока Из ВыбранныеСтроки Цикл
		ВыбранныеПИФ.Добавить(ВыбраннаяСтрока.СчетДоверительногоУправления);		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);

	Если Не ЭтаФорма.ЭтоПодтверждениеСЧА Тогда
		Для Каждого СтрокаПИФ Из Объект.ПаевыеИнвестиционныеФонды Цикл
			СтрокаПИФ.Выбран = (ВыбранныеПИФ.НайтиПоЗначению(СтрокаПИФ.СчетДоверительногоУправления) <> Неопределено);		
		КонецЦикла;		
	КонецЕсли;     
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ПодключитьРасширениеРаботыСФайлами() Тогда
		ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогСохраненияФайла.ПолноеИмяФайла     = Объект.ПутьКФайлу;
		ДиалогСохраненияФайла.Фильтр             = НСтр("ru = 'Файл выгрузки (*.xml)|*.xml'");
		ДиалогСохраненияФайла.ИндексФильтра      = 0;
		ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
		ДиалогСохраненияФайла.Заголовок          = НСтр("ru = 'Укажите файл'");
		
		Если ДиалогСохраненияФайла.Выбрать() Тогда
			Объект.ПутьКФайлу = ДиалогСохраненияФайла.ПолноеИмяФайла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда 
		ЗапуститьПриложение(Объект.ПутьКФайлу);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПаевыеИнвестиционныеФондыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.ПаевыеИнвестиционныеФонды.ТекущиеДанные.Выбран = Истина;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаЗаПериодПриИзменении(Элемент)
	
	Элементы.ГруппаПериод.Видимость = ЭтаФорма.ВыгрузкаЗаПериод;
	Элементы.КонецПериодаДень.Видимость = Не ЭтаФорма.ВыгрузкаЗаПериод;
	Элементы.ПаевыеИнвестиционныеФондыГруппаКонтрольЗаДень.Видимость = Не ЭтаФорма.ВыгрузкаЗаПериод;
	Элементы.ПаевыеИнвестиционныеФондыГруппа3.Группировка = ?(ЭтаФорма.ВыгрузкаЗаПериод, ГруппировкаКолонок.Горизонтальная, ГруппировкаКолонок.Вертикальная);
	
	ЗаполнитьПаевыеИнвестиционныеФонды();
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаДеньПриИзменении(Элемент)
	
	Объект.НачалоПериода = Объект.КонецПериода;
	
	ЗаполнитьПаевыеИнвестиционныеФонды();
	
КонецПроцедуры

&НаКлиенте
Процедура ПаевыеИнвестиционныеФондыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СписокПолейДок = "ПаевыеИнвестиционныеФондыПодтверждена,ПаевыеИнвестиционныеФондыРегистрацияСтоимостиАктивов,ПаевыеИнвестиционныеФондыСЧА,ПаевыеИнвестиционныеФондыРСА,ПаевыеИнвестиционныеФондыСтоимостьПая";
	ТекСтрока = Объект.ПаевыеИнвестиционныеФонды.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если СтрНайти(СписокПолейДок, Поле.Имя) > 0 Тогда
		
		РегистрацияСтоимостиАктивов = ТекСтрока.РегистрацияСтоимостиАктивов;
		Если ЗначениеЗаполнено(РегистрацияСтоимостиАктивов) Тогда
			ОткрытьЗначение(РегистрацияСтоимостиАктивов);
		КонецЕсли; 
		
	ИначеЕсли Поле.Имя = "ПаевыеИнвестиционныеФондыПодтверждениеСсылка" Тогда
		
		РегистрацияСтоимостиАктивов = ТекСтрока.РегистрацияСтоимостиАктивов;
		Если ЗначениеЗаполнено(РегистрацияСтоимостиАктивов) Тогда
			ПараметрыФормы = Новый Структура("Операция", РегистрацияСтоимостиАктивов);
			ОповещениеПриЗакрытииДочернегоОкна = Новый ОписаниеОповещения("ПриЗакрытииДочернегоОкна", ЭтаФорма);
			ОткрытьФорму("РегистрСведений.ПодтверждениеОперацийБэкОфиса.Форма.ФормаИсторияПодтвержденияОперации", ПараметрыФормы, ЭтаФорма, ЭтаФорма,,, ОповещениеПриЗакрытииДочернегоОкна, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "ПаевыеИнвестиционныеФондыПИФ" Тогда
		
		ОткрытьЗначение(ТекСтрока.СчетДоверительногоУправления);
		
	ИначеЕсли Поле.Имя = "ПаевыеИнвестиционныеФондыУправляющаяКомпания" Тогда
		
		ОткрытьЗначение(ТекСтрока.УправляющаяКомпания);
		
	ИначеЕсли Поле.Имя = "ПаевыеИнвестиционныеФондыГиперссылка" Тогда
		
		Если ЗначениеЗаполнено(ТекСтрока.АдресСайта) Тогда
			ЗапуститьПриложение(ТекСтрока.АдресСайта);
		КонецЕсли; 
	ИначеЕсли Поле.Имя = "ПаевыеИнвестиционныеФондыГиперссылкаИнтерфакс" Тогда
		
		Если ЗначениеЗаполнено(ТекСтрока.АдресСайтаИнтерфакс) Тогда
			ЗапуститьПриложение(ТекСтрока.АдресСайтаИнтерфакс);
		КонецЕсли;	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область Команды_формы

&НаКлиенте
Процедура КомандаВвестиПериод(Команда)
	ДиалогВыбораПериода = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогВыбораПериода.Период.ДатаНачала		= Объект.НачалоПериода;
	ДиалогВыбораПериода.Период.ДатаОкончания	= Объект.КонецПериода;
	
	Если ДиалогВыбораПериода.Редактировать() Тогда 
		Объект.НачалоПериода	= ДиалогВыбораПериода.Период.ДатаНачала;
		Объект.КонецПериода		= ДиалогВыбораПериода.Период.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьОтметки(Команда)
	ИзменитьОтметки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьОтметки(Команда)
	ИзменитьОтметки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыгрузитьИОтправить(Команда)
	Если Выгрузить() Тогда
		Отправить(Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыгрузить(Команда)	
	Если Выгрузить() Тогда		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файлы успешно выгружены!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтправить(Команда)
	Отправить(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтправитьВMatrix(Команда)
	Если ОтправитьВMatrix() Тогда		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данные успешно отправлены в Matrix!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтправитьВЛКК(Команда)
	
	Если ОтправитьВЛКК() Тогда		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данные успешно отправлены в ЛКК!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	
	ЗаполнитьПаевыеИнвестиционныеФонды();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединение(Команда)
	
	ПроверитьСоединениеНаСервере(ПолучитьСтруктуруПараметровПодключения());
	
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаКлиенте
Процедура ЗаполнитьПаевыеИнвестиционныеФонды()

	КлючТекущейСтрокиРаспоряженияПлановые = РаботаСФормамиКлиент.ПолучитьКлючТекущейСтроки(Элементы.ПаевыеИнвестиционныеФонды,  "СчетДоверительногоУправления");
	ЗаполнитьПаевыеИнвестиционныеФондыСервер();
	ПолучитьИнформациюССайта();
	РаботаСФормамиКлиент.ВосстановитьТекущуюСтрокуПоКлючу(Объект.ПаевыеИнвестиционныеФонды, Элементы.ПаевыеИнвестиционныеФонды, "СчетДоверительногоУправления", КлючТекущейСтрокиРаспоряженияПлановые);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПаевыеИнвестиционныеФондыСервер()

	ТаблицаПаевыхИнвестиционныхФондов = Обработки.ОтправкаДанныхПИФНаСайт.ПолучитьТаблицуПаевыхИнвестиционныхФондов(Объект.Организация, Объект.КонецПериода, Не ЭтотОбъект.ВыгрузкаЗаПериод);
	
	Объект.ПаевыеИнвестиционныеФонды.Загрузить(ТаблицаПаевыхИнвестиционныхФондов);
	
	Для Каждого СтрокаПИФ Из Объект.ПаевыеИнвестиционныеФонды Цикл
		СтрокаПИФ.Выбран = (ВыбранныеПИФ.НайтиПоЗначению(СтрокаПИФ.СчетДоверительногоУправления) <> Неопределено);		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОтметки(Значение)
	Для Каждого СтрокаПИФ Из Объект.ПаевыеИнвестиционныеФонды Цикл
		СтрокаПИФ.Выбран = Значение;		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция Выгрузить() Экспорт
	
	Если Не ПроверитьЗаполнение() И (Не (ЭтаФорма.ЭтоПолноправныйПользователь Или ЭтаФорма.ЭтоКонтролер)
		Или Вопрос("Есть неподтвержденные операции. Все равно продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВыгруженоУспешно	= Истина;
	Ошибки				= Новый Массив;
	
	// Формируем файлы выгрузки
	ОписанияФайлов = СформироватьФайлыВыгрузкиНаСервере(Ошибки);
	
	Если ОписанияФайлов <> Неопределено Тогда
		// Сохраняем на клиенте
		ПолучитьФайлы(ОписанияФайлов, , , Ложь);		
	КонецЕсли;
	
	// Выводим сообщения об ошибках
	Если ЗначениеЗаполнено(Ошибки) Тогда
		ВыгруженоУспешно = Ложь;			
		
		Для Каждого ТекстОшибки Из Ошибки Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);	
		КонецЦикла;
	КонецЕсли;
	
	// Если данные выгружены успешно
	Если ВыгруженоУспешно Тогда
		ЭтаФорма.Модифицированность = Ложь;
	КонецЕсли;
	
	Возврат ВыгруженоУспешно;
КонецФункции

&НаСервере
Функция СформироватьФайлыВыгрузкиНаСервере(Ошибки)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Возврат ОбработкаОбъект.СформироватьФайлыВыгрузки(Ошибки);
КонецФункции

&НаКлиенте
Функция Отправить(ОтправитьВМатрих) Экспорт
	
	Если ЭтаФорма.Модифицированность Тогда
		Предупреждение("Параметры выгрузки были изменены." + Символы.ПС + "Перед отправкой необходимо произвести повторную выгрузку данных.");
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Путь к файлу"" не заполнено", , "Объект.ПутьКФайлу");
		Возврат Ложь;
	КонецЕсли;

	// Защита от случайной отправки данных из копии базы
	ЭтоРабочаяИнформационнаяБаза = ОбщегоНазначения.ЗначениеПараметраСеанса("ЭтоРабочаяИнформационнаяБаза");
	Если Не ЭтоРабочаяИнформационнаяБаза Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отправка данных из копии ИБ запрещена!");
		Возврат Ложь;
	КонецЕсли;
	
	Файл = Новый Файл(Объект.ПутьКФайлу);
	
	ОписанияФайлов = Новый Массив;
	ОписанияФайлов.Добавить(
		Новый Структура("ИмяФайла, АдресВХранилище, ИдентификаторОбменаДанными",
		    Файл.Имя,
			ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Объект.ПутьКФайлу), ЭтаФорма.УникальныйИдентификатор),
			Новый УникальныйИдентификатор
		)
	);
	
	Состояние("Отправка файлов на сайт...");
	ОтправитьФайлы(ОписанияФайлов, ПолучитьСтруктуруПараметровПодключения());
	
	// Отправляем в ЛКК
	ОтправитьВЛККНаСервере();
	
	Если ОтправитьВМатрих Тогда
		// Отправляем данные в Matrix
		ОтправитьВMatrixНаСервере();
	КонецЕсли;
		
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файлы успешно отправлены!");
	
	Если Не ЭтоПодтверждениеСЧА Тогда
		ПолучитьИнформациюССайта();
	КонецЕсли; 
	
	ОтправитьОповещениеНаСервере();
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ОтправитьОповещениеНаСервере()

	НайденныеСтроки = Объект.ПаевыеИнвестиционныеФонды.НайтиСтроки(Новый Структура("Выбран", Истина));
	
	ТемаПисьма = "Стоимость паев отправлена на сайт";
	ТелоПисьма = "";
	     
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	ИначеЕсли НайденныеСтроки.Количество() = 1 Тогда
		СтрокаНайденныеСтроки = НайденныеСтроки[0];
		ТемаПисьма = ТемаПисьма + ". " + СтрокаНайденныеСтроки.СчетДоверительногоУправления;
		ТелоПисьма = ТемаПисьма + ". <a href=""" + СтрокаНайденныеСтроки.АдресСайта + """>Открыть на сайте</a>";
	Иначе
		ТелоПисьма = "<P>Выполнена отправка по следующим ПИФ:</P>";
		Для каждого СтрокаНайденныеСтроки Из НайденныеСтроки Цикл
			ТелоПисьма = ТелоПисьма + Символы.ПС + "<P>" + СтрокаНайденныеСтроки.СчетДоверительногоУправления + ". <a href=""" + СтрокаНайденныеСтроки.АдресСайта + """>Открыть на сайте</a></P>";
		КонецЦикла; 
	КонецЕсли; 
	
	РеквизитыОповещения = Новый Структура("Организация, Тема, Текст", Объект.Организация, ТемаПисьма, ТелоПисьма);
	Справочники.Оповещения.СформироватьОповещения("Обработка.ОтправкаДанныхПИФНаСайт.ОтправитьОповещениеНаСервере()", Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);

КонецПроцедуры
 
&НаСервереБезКонтекста
Функция ОткрытьСессию(ПараметрыПодключения)
	sessionOptions = Новый COMОбъект("WinSCP.SessionOptions"); //Создаем объект SessionOptions
	session = Новый COMОбъект("WinSCP.Session"); // Создаем объект Session
	Если НРег(ПараметрыПодключения.Протокол) = "sftp" Тогда
		
		Если ПустаяСтрока(ПараметрыПодключения.Ключ) Тогда
			Url = ПараметрыПодключения.Протокол + "://" + ПараметрыПодключения.ИмяПользователя + ":" + ПараметрыПодключения.Пароль + "@" + ПараметрыПодключения.Сервер + "/";
		Иначе
			Url = ПараметрыПодключения.Протокол + "://" + ПараметрыПодключения.ИмяПользователя + "@" + ПараметрыПодключения.Сервер + "/";
			ИмяВременногоФайла = КаталогВременныхФайлов() + "key.ppk";
			ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла, "CESU-8");
			ЗаписьТекста.Записать(ПараметрыПодключения.Ключ);
			ЗаписьТекста.Закрыть();
			sessionOptions.SshPrivateKeyPath = ИмяВременногоФайла;
		КонецЕсли;
		
		sessionOptions.ParseUrl(Url);
		fingerprint = session.ScanFingerprint(sessionOptions, "SHA-256");
		sessionOptions.SshHostKeyFingerprint = fingerprint;
	Иначе
		Url = ПараметрыПодключения.Протокол + "://" + ПараметрыПодключения.ИмяПользователя + ":" + ПараметрыПодключения.Пароль + "@" + ПараметрыПодключения.Сервер + "/";
		sessionOptions.ParseUrl(Url);
	КонецЕсли;
	session.Open(sessionOptions);

	Возврат session;
КонецФункции

&НаСервереБезКонтекста
Процедура ОтправитьФайлы(ОписанияФайлов, ПараметрыПодключения)
	Для Каждого ОписаниеФайла Из ОписанияФайлов Цикл
		
		ИмяВременногоКаталога = ПолучитьИмяВременногоФайла();
		Файл = Новый Файл(ИмяВременногоКаталога);
		Если Не Файл.Существует() Тогда
			СоздатьКаталог(ИмяВременногоКаталога);
		КонецЕсли; 
		ИмяВременногоФайла = ИмяВременногоКаталога + "\xml.xml";
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ОписаниеФайла.АдресВХранилище);
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		
		УспешнаяВыгрузкаНаФТП = Ложь;
	
		Попытка
			// Выгружаем файлы
			session = ОткрытьСессию(ПараметрыПодключения);
			
			Если Не СтрНачинаетсяС(ПараметрыПодключения.ТекущийКаталог, "/") Тогда
				ПараметрыПодключения.ТекущийКаталог = "/" + ПараметрыПодключения.ТекущийКаталог;
			КонецЕсли; 
			Если Не СтрЗаканчиваетсяНа(ПараметрыПодключения.ТекущийКаталог, "/") Тогда
				ПараметрыПодключения.ТекущийКаталог = ПараметрыПодключения.ТекущийКаталог + "/";
			КонецЕсли; 
		
			transferOptions = Новый COMОбъект("WinSCP.transferOptions");
			transferOptions.PreserveTimestamp = false;
			transferResult = session.PutFiles(ИмяВременногоФайла, ПараметрыПодключения.ТекущийКаталог, false, transferOptions);
			// Проверяем результат на возможные ошибки
			transferResult.Check();
			
			session.Close();
			УспешнаяВыгрузкаНаФТП = Истина;
						
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;
		
		Если Не УспешнаяВыгрузкаНаФТП Тогда
			
			УдалитьФайлы(ИмяВременногоКаталога);	
			ОписаниеОшибки = "Ошибка выгрузки данных на FTP. Система сообщает: """ + ОписаниеОшибки + """";
			Справочники.Оповещения.СформироватьОповещения("Обработка.ОтправкаДанныхПИФНаСайт", Перечисления.ТипыСобытий.ВнешнийВызов, Новый Структура("ОписаниеОшибки", ОписаниеОшибки));
			ВызватьИсключение ОписаниеОшибки;
			
		Иначе
			
			// Сообщаем сайту о новом файле
			Если ПараметрыПодключения.ЗащищенноеСоединение Тогда
				ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
			Иначе
				ЗащищенноеСоединение = Неопределено;
			КонецЕсли; 
			HTTPСоединение	= Новый HTTPСоединение(ПараметрыПодключения.АдресСайта,,,,,, ЗащищенноеСоединение);
			HTTPЗапрос		= Новый HTTPЗапрос(ПараметрыПодключения.Скрипт + ОписаниеФайла.ИмяФайла);
			
			Результат = HTTPСоединение.Получить(HTTPЗапрос);			
			
			ДобавитьЗаписьАсинхронногоОбмена(ОписаниеФайла, Результат);
			
			Если Результат.КодСостояния >= 300 Тогда 
				
				УдалитьФайлы(ИмяВременногоКаталога);	
				ОписаниеОшибки = "Ошибка отправки данных на сайт (код состояния: " + Результат.КодСостояния + ")";
				Справочники.Оповещения.СформироватьОповещения("Обработка.ОтправкаДанныхПИФНаСайт", Перечисления.ТипыСобытий.ВнешнийВызов, Новый Структура("ОписаниеОшибки", ОписаниеОшибки));
				ВызватьИсключение ОписаниеОшибки;
				
			КонецЕсли;
			
		КонецЕсли;
		
		УдалитьФайлы(ИмяВременногоКаталога);	
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ОтправитьВMatrix() Экспорт
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭтоРабочаяИнформационнаяБаза = ОбщегоНазначения.ЗначениеПараметраСеанса("ЭтоРабочаяИнформационнаяБаза");
	Если Не ЭтоРабочаяИнформационнаяБаза Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отправка данных из копии ИБ запрещена!");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ОтправитьВMatrixНаСервере();
	
КонецФункции

&НаСервере
Функция ОтправитьВMatrixНаСервере()
	ОтправленоУспешно	= Истина;
	Ошибки				= Новый Массив;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОтправитьВMatrix(Ошибки);	
	
	// Выводим сообщения об ошибках
	Если ЗначениеЗаполнено(Ошибки) Тогда
		ОтправленоУспешно = Ложь;			
		
		Если РаботаСПользователями.ЭтоПолноправныйПользователь() Тогда 
			Для Каждого ТекстОшибки Из Ошибки Цикл
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);	
			КонецЦикла;
		Иначе
			УстановитьПривилегированныйРежим(Истина);
			
			ИсточникОшибки = ПолучитьИсточникОшибки(ОбработкаОбъект.Метаданные().Имя, Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка);
			Если ИсточникОшибки = Неопределено Тогда
				ИсточникОшибки = ОбработкаОбъект.Метаданные().Синоним;	
			КонецЕсли;
			
			Для Каждого ТекстОшибки Из Ошибки Цикл
				ЗаписьЖурналаРегистрации("Ошибка отправки данных в Matrix", УровеньЖурналаРегистрации.Ошибка, , ОбработкаОбъект.Метаданные().ПолноеИмя(), ТекстОшибки);
				РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку("Ошибка отправки данных в Matrix:" + Символы.ПС + ТекстОшибки, ИсточникОшибки);
			КонецЦикла;
			
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
	КонецЕсли;
		
	Возврат ОтправленоУспешно;
КонецФункции

&НаКлиенте
Функция ОтправитьВЛКК()

	Если Не ПроверитьЗаполнение() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Если это копия рабочей базы, выгружаем в тестовый ЛКК (прописано в обработке обмена с ЛКК)	
	Возврат ОтправитьВЛККНаСервере();
	
КонецФункции

&НаСервере
Функция ОтправитьВЛККНаСервере()
	
	ОтправленоУспешно	= Истина;
	Ошибки				= Новый Массив;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОтправитьВЛКК(Ошибки);	
	
	// Выводим сообщения об ошибках
	Если ЗначениеЗаполнено(Ошибки) Тогда
		
		ОтправленоУспешно = Ложь;			
		
		Если РаботаСПользователями.ЭтоПолноправныйПользователь() Тогда 
			Для Каждого ТекстОшибки Из Ошибки Цикл
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);	
			КонецЦикла;
		Иначе
			УстановитьПривилегированныйРежим(Истина);
			
			ИсточникОшибки = ПолучитьИсточникОшибки(ОбработкаОбъект.Метаданные().Имя, Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка);
			Если ИсточникОшибки = Неопределено Тогда
				ИсточникОшибки = ОбработкаОбъект.Метаданные().Синоним;	
			КонецЕсли;
			
			Для Каждого ТекстОшибки Из Ошибки Цикл
				ЗаписьЖурналаРегистрации("Ошибка отправки данных в ЛКК", УровеньЖурналаРегистрации.Ошибка, , ОбработкаОбъект.Метаданные().ПолноеИмя(), ТекстОшибки);
				РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку("Ошибка отправки данных в ЛКК:" + Символы.ПС + ТекстОшибки, ИсточникОшибки);
			КонецЦикла;
			
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат ОтправленоУспешно;
	
КонецФункции

&НаСервере
Функция ПолучитьИсточникОшибки(ИмяОбъекта, Вид)
	Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ДополнительныеОтчетыИОбработки.Ссылка
		|ИЗ
		|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
		|ГДЕ
		|	ДополнительныеОтчетыИОбработки.ИмяОбъекта = &ИмяОбъекта
		|	И ДополнительныеОтчетыИОбработки.Вид = &Вид
		|	И ДополнительныеОтчетыИОбработки.ПометкаУдаления = ЛОЖЬ
		|");
	Запрос.УстановитьПараметр("ИмяОбъекта", ИмяОбъекта);
	Запрос.УстановитьПараметр("Вид",        Вид);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка; 	
	КонецЕсли;	
	
	Возврат Неопределено;	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытииДочернегоОкна(Параметр, ДополнительныеПараметры) Экспорт
	
	ЗаполнитьПаевыеИнвестиционныеФонды();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не (ЭтаФорма.ЭтоПодтверждениеСЧА Или ЭтаФорма.ВыгрузкаЗаПериод) Тогда
	
		НайденныеСтроки = Объект.ПаевыеИнвестиционныеФонды.НайтиСтроки(Новый Структура("Выбран, Подтверждена", Истина, Ложь));
		
		Для каждого СтрокаНайденныеСтроки Из НайденныеСтроки Цикл
			
			ТекстОшиибки = СтрШаблон("СЧА по '%1' не подтверждена", СтрокаНайденныеСтроки.СчетДоверительногоУправления);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшиибки,,,, Отказ);
		
		КонецЦикла; 		
	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьИнформациюССайта()

	Попытка
	
		Если ЭтаФорма.ВыгрузкаЗаПериод Тогда
			Возврат;
		КонецЕсли; 
		
		Обработки.ОтправкаДанныхПИФНаСайт.ПолучитьИнформациюССайта(Объект.Организация, Объект.КонецПериода, Объект.ПаевыеИнвестиционныеФонды);
		
	Исключение
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить данные с сайта");
	      
	КонецПопытки; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьЗаписьАсинхронногоОбмена(ОписаниеФайла, Результат)

	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ОписаниеФайла.АдресВХранилище);
	ЧтениеДанных = Новый ЧтениеДанных(ДвоичныеДанные);
	ЧтениеТекста = Новый ЧтениеТекста(ЧтениеДанных.ИсходныйПоток());
	ТекстЗапроса = ЧтениеТекста.Прочитать();
	
	Запись = РегистрыСведений.АсинхронныйОбменДанными.СоздатьМенеджерЗаписи();
	Запись.ВнешняяСистема = Справочники.ВнешниеСистемы.СайтГКРегион;
	Запись.УникальныйИдентификатор = ОписаниеФайла.ИдентификаторОбменаДанными;	
	Запись.ТипПакета = Справочники.ГруппыИмпортируемыхОбъектов.ИмпортДанныхПИФ;
	Запись.ТекстЗапроса = Новый ХранилищеЗначения(ТекстЗапроса, Новый СжатиеДанных(9));
	Запись.ТекстОтвета = Новый ХранилищеЗначения(Результат.ПолучитьТелоКакСтроку(), Новый СжатиеДанных(9));
	Запись.КодСостояния = Результат.КодСостояния;
	Запись.ДатаЗапроса = ТекущаяДатаСеанса();
	Запись.СтатусОтвета = ?(Результат.КодСостояния >= 300, Перечисления.СтатусыОтветаАсинхронногоОбменаДанными.Ошибка, Перечисления.СтатусыОтветаАсинхронногоОбменаДанными.Исполнено);
	Запись.Пользователь = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущийПользователь");
	Запись.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСоединениеНаСервере(ПараметрыПодключения)

	ИмяВременногоФайла = КаталогВременныхФайлов() + "CheckUploadSCP.txt";
	ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла);
	ЗаписьТекста.Записать(Формат(ТекущаяДата(), "ДЛФ=DT"));
	ЗаписьТекста.Закрыть();
	
	session = ОткрытьСессию(ПараметрыПодключения);
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Соединение установлено успешно");
	
	// Выгружаем файлы
	Если Не СтрНачинаетсяС(ПараметрыПодключения.ТекущийКаталог, "/") Тогда
		ПараметрыПодключения.ТекущийКаталог = "/" + ПараметрыПодключения.ТекущийКаталог;
	КонецЕсли; 
	Если Не СтрЗаканчиваетсяНа(ПараметрыПодключения.ТекущийКаталог, "/") Тогда
		ПараметрыПодключения.ТекущийКаталог = ПараметрыПодключения.ТекущийКаталог + "/";
	КонецЕсли; 

	transferOptions = Новый COMОбъект("WinSCP.transferOptions");
	transferOptions.PreserveTimestamp = false;
	transferResult = session.PutFiles(ИмяВременногоФайла, ПараметрыПодключения.ТекущийКаталог, false, transferOptions);
	// Проверяем результат на возможные ошибки
	transferResult.Check();
	
	session.Close();
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл выгружен успешно");
	
	УдалитьФайлы(ИмяВременногоФайла);

КонецПроцедуры
 
#КонецОбласти 

#Область Параметры_подключения

&НаКлиенте
Процедура ПеречитатьПараметрыПодключения(Команда)
	
	ПараметрыПодключения = ПрочитатьПараметрыПодключения(Объект.Организация);
	Если ТипЗнч(ПараметрыПодключения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ПараметрыПодключения);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПрочитатьПараметрыПодключения(Организация)

	Значение = ПланыВидовХарактеристик.ДополнительныеСведения.ЗначениеДополнительнойНастройки(, "_ПараметрыОтправкиДанныхПИФНаСайт", Организация);
	НеЗаданыПараметры = Ложь;
	
	Если Значение <> Неопределено Тогда
		Попытка
			XMLЗначение = XMLЗначение(Тип("ХранилищеЗначения"), Значение);
			ПараметрыПодключения = XMLЗначение.Получить();
			Значение = ПланыВидовХарактеристик.ДополнительныеСведения.ЗначениеДополнительнойНастройки(, "_ПараметрыОтправкиДанныхПИФНаСайтКлюч", Организация);
			Если Значение <> Неопределено Тогда
				Попытка
					XMLЗначение = XMLЗначение(Тип("ХранилищеЗначения"), Значение);
					ПараметрыПодключения.Ключ = XMLЗначение.Получить();
				Исключение
					ПараметрыПодключения.Ключ = "";
				КонецПопытки;
			КонецЕсли;
			
			Возврат ПараметрыПодключения;
		Исключение
			НеЗаданыПараметры = Истина;
		КонецПопытки;
	Иначе
		НеЗаданыПараметры = Истина;
	КонецЕсли;
	
	Если НеЗаданыПараметры Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для организации " + Организация + " не заданы параметры выгрузки на сайт");
	КонецЕсли; 
		
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьПараметрыПодключенияНаСервере(Организация, ПараметрыПодключения)
	
	Если Не ПустаяСтрока(ПараметрыПодключения.Ключ) Тогда
		Свойство = ПланыВидовХарактеристик.ДополнительныеСведения.НайтиПоРеквизиту("Ключ", "_ПараметрыОтправкиДанныхПИФНаСайтКлюч");
		Если ЗначениеЗаполнено(Свойство) Тогда
			Запись = РегистрыСведений.ЗначенияДополнительныхСведений.СоздатьМенеджерЗаписи();
			Запись.Объект = Организация;
			Запись.Свойство = Свойство;
			Запись.Значение = XMLСтрока(Новый ХранилищеЗначения(ПараметрыПодключения.Ключ, Новый СжатиеДанных(9)));
			Запись.Записать();		
			XMLЗначение(Тип("ХранилищеЗначения"), XMLСтрока(Новый ХранилищеЗначения(ПараметрыПодключения, Новый СжатиеДанных(9)))).Получить()
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдено дополнительное свойство ""_ПараметрыОтправкиДанныхПИФНаСайтКлюч""");
		КонецЕсли;
		ПараметрыПодключения.Ключ = "";
	КонецЕсли;
	
	Свойство = ПланыВидовХарактеристик.ДополнительныеСведения.НайтиПоРеквизиту("Ключ", "_ПараметрыОтправкиДанныхПИФНаСайт");
	Если ЗначениеЗаполнено(Свойство) Тогда
		Запись = РегистрыСведений.ЗначенияДополнительныхСведений.СоздатьМенеджерЗаписи();
		Запись.Объект = Организация;
		Запись.Свойство = Свойство;
		Запись.Значение = XMLСтрока(Новый ХранилищеЗначения(ПараметрыПодключения, Новый СжатиеДанных(9)));
		Запись.Записать();		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдено дополнительное свойство ""_ПараметрыОтправкиДанныхПИФНаСайт""");
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПараметрыПодключения(Команда)
	
	ЗаписатьПараметрыПодключенияНаСервере(Объект.Организация, ПолучитьСтруктуруПараметровПодключения());
	Элементы.ПараметрыПодключения.Скрыть();
	
КонецПроцедуры

&НаКлиенте 
Функция ПолучитьСтруктуруПараметровПодключения()

	ПараметрыПодключения = Новый Структура("Протокол, Сервер, ИмяПользователя, Пароль, ТекущийКаталог, АдресСайта, Скрипт, ЗащищенноеСоединение, Ключ");
	ЗаполнитьЗначенияСвойств(ПараметрыПодключения, ЭтаФорма);
	
	Возврат ПараметрыПодключения;

КонецФункции
 
#КонецОбласти
